assignment_3/app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
    @number_of_completed_todos = TodoItem.count_completed_items
---
SELECT "todo_items".* FROM "todo_items"
SELECT COUNT(*) FROM "todo_items" WHERE "todo_items"."completed" = ?  [["completed", "t"]]

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Random"], ["description", ""], ["due_date", "2016-10-10"], ["created_at", "2016-10-10 18:51:28.095864"], ["updated_at", "2016-10-10 18:51:28.095864"]]

    def set_todo_item
      @todo_item = TodoItem.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 4]]